{
  "about": {
    "subTitle": "Smart Contract Art Collection",
    "description": " Here is a site that showcases Ara's experimental artwork using smart contracts."
  },
  "protein": {
    "subTitle": "― replication, influence, and limit",
    "workInfo": "NFT contract, Solidity, 2022",
    "abstract": "“Protein” is an NFT contract created with an awareness of associations between individual NFTs within the same smart contract. When an NFT is newly minted, it affects “all” other NFTs in the contract. This is very common with physical objects, but most NFTs as of 2022 do not have this property. This NFT contract gives such a natural property to digital objects.",
    "replication": "Replication",
    "replicationDescription": "NFT can be minted by anyone. At that time, all NFTs minted so far will be sent to their previous owner. The NFT owned by the first minter will be replaced by the NFT with the latest ID each time someone mints it. This is similar to a protein being replaced by a new one and metabolism taking place.",
    "influence": "Influence",
    "influenceDescription": "The birth of one NFT will cause all other NFTs to move. When someone does something in this world, it will affect everything else in some way. This is also true in the digital space. This work will be one of the earliest simple examples of its implementation.",
    "limit": "Limit",
    "limitDescription": "Living things will die at some point. Metabolism will eventually end; DNA replication is not infinite. The same is true for this NFT: minting a new NFT causes all other NFTs to be sent, and the amount of processing grows as the number of NFTs grows. And at some number of mints, it will reach Ethereum's gas limit. This will be the mint limit for this NFT.",
    "links": "Links",
    "etherscanDescription": "If you value this NFT and wish to participate in the artwork, you can mint the NFT by executing the safeMint() function in Etherscan. Enter your ETH address as the argument. All you need is the gas cost.",
    "githubDescription": "If you want to know more about how this NFT works, you can find the source code and development environment of the smart contract on GitHub.",
    "openseaDescription": "If you want to see images and metadata of the NFT, or if you want to buy or sell the NFT, you can use OpenSea. Note that this work does not focus on the visuals of the NFT, and the metadata can be modified by the contract administrator."
  },
  "selfReplication": {
    "workInfo": "Cadence smart contract, 2022",
    "abstract": "“Self-Replication” is a smart contract that can replicate itself. It is deployed on the Flow blockchain using the Cadence programming language, which allows for intuitive code expression.",
    "codeExecution": "Ideal code writing/execution environment",
    "codeExecutionDescription": "Smart contracts executed on the blockchain are a code execution environment with common state throughout the world, where who created the code and when it was created and who executed what remains forever. This is an ideal environment for writing and executing artistic code. I used this environment to explore ways to create code that changes as it receives feedback. This work is the first step in that direction, creating a minimal code that can replicate itself.",
    "codeIncubator": "Accounts as mothers for nurturing code",
    "codeIncubatorDescription": "Flow provides a storage area for each account where smart contracts can be deployed. In the minimal implementation, I have created one function that takes an account as a function argument and deploys a new contract to that account in code. The code of the deployed contract internally references the code of the executing contract itself. This looks as if it is giving a new life to the mother.",
    "codeDescription": "Explanation of the code",
    "codeDescriptionDescription": "The `SelfReplication` contract has a contract variable named `name`, which is initialized to a fixed string when the contract is deployed. The `replicate` function takes an account as an argument and adds the contract within that account. In this case, the code passed as the argument is passed as it is. Its own code is taken from the account (`self.account`) where the contract is deployed, specifying the name of the contract.",
    "links": "Links",
    "flowscanDescription1": "The first deployed contract",
    "flowscanDescription2": "Transaction to replicate the contract",
    "githubDescription": "Source code for the contract and transaction"
  },
  "mutation": {
    "workInfo": "Cadence smart contract, 2022",
    "abstract": "“Mutation” is a further development of “Self-Replication”, a smart contract that can randomly change its own code in addition to replicating it.",
    "meaning": "Continuous code change history",
    "meaningDescription": "With blockchain and smart contracts, code can be written and executed in the same place. Traditionally, to achieve this, a separate, dedicated environment had to be built, but smart contracts enable this difficulty to be overcome. This piece provides the simple example. The smart contract has a function called `mutate()` that can be called to make changes to its own code. In this example, the name of the contract `Mutation` is randomly changed to a single letter `X`. For example, `MXtation`. The code that has been modified is then replicated by calling the function `replicate()`. Any history of changes to the code will remain persistent.",
    "codeDescription": "Explanation of the code",
    "codeDescriptionDescription": "The `Mutation` contract has `mutate()` function and `replicate()` function. When the `mutate()` function is called, it determines the position at which to rewrite one character of the contract's name, pseudo-randomly, using the current block ID (line 13). In lines 26-29, the part of the code of the contract that contains the name is replaced with the changed name and stored in the contract variable. Then, when the `replication()` function is called, it deploys the stored name and code into the passed account (line 33).",
    "links": "Links",
    "flowscanDescription1": "The first deployed contract",
    "flowscanDescription2": "Transaction to mutate the contract",
    "githubDescription": "Source code for the contract and transaction"
  },
  "semi": {
    "workInfo": "NFT Contracts, Solidity, 2022",
    "demoNote": "* Click on the cicada to hear the sound.",
    "abstract": "Semi (蝉 / セミ / Cicada) is an experimental NFT smart contract that incorporates a variety of elements. Digital items that influence each other, interactive content that sounds, updatable and composable design, and better metadata that empowers the owner.",
    "affectEachOthers": "Influencing Each Other",
    "affectEachOthersDescription": "The NFT can be minted by anyone; when the NFT is minted, a cicada of one of five randomly determined types is rendered at a random position (x, y coordinates). If you own more than one cicada, the number of cicadas will be rendered. The image of each cicada is generated by all other cicadas owned by the same address. When a cicada is sent to another address, the cicada is gone from the images of all other cicadas of the same address. This property will be an important factor in giving the digital item a real feeling.",
    "interactive": "Interactive Content with Sound",
    "interactiveDescription": "Clicking on a cicada will play a sound that corresponds to the type of cicada. As the number and types of cicadas increase, more sound combinations can be enjoyed. The logic is implemented in HTML and JavaScript, with code generated on-chain.",
    "composability": "Updatable and Composable Design",
    "composabilityDescription": "The NFT contract is designed so that the renderer that draws the image can be changed. This allows for incremental changes to the content in addition to allowing for maintenance on the rendering. In the renderer, logic and assets are completely separated. All logic is generated on-chain, while assets reference off-chain images and music. In other words, this is not full on-chain, but it is a semi-on-chain NFT.",
    "betterMetadata": "Better Metadata with Owner Authority",
    "betterMetadataDescription": "What exactly do we own by using NFT technology? One answer is the association with some metadata. You could say that the metadata that is associated is the identity of the digital object as perceived by its owner. The metadata associated with the object is not something that can be changed by someone else without permission. This NFT allows the contract creator to update the NFT's renderer, but it presents a better way for metadata by allowing the owner to choose its association. Owners are free to select any previously registered renderer they desire.",
    "links": "Links",
    "etherscanDescription": "If you value this NFT and wish to participate in the artwork, you can mint the NFT by executing the mint() function in Etherscan. Enter your ETH address as the argument. All you need is the gas cost.",
    "githubDescription": "If you want to know more about how this NFT works, you can find the source code and development environment of the smart contract on GitHub.",
    "openseaDescription": "If you want to see images and metadata of the NFT, or if you want to buy or sell the NFT, you can use OpenSea."
  },
  "theNft": {
    "subTitle": "― What makes an NFT an NFT?",
    "workInfo": "NFT Contracts, Cadence and Solidity, 2023",
    "abstract": "“The NFT” is a work consisting of two smart contracts that question the nature of NFT. One is an NFT contract using Cadence, a resource-oriented programming language, and the other is an NFT contract using Solidity, the most popular smart contract language today.",
    "whatIsNFT": "What Makes an NFT an NFT",
    "whatIsNFTDescription": "The most important metadata returned by this NFT is the “ID“. It is simply a number that is sequentially numbered within this contract; an NFT can be associated with a variety of information, including images, but that association cannot be proven to be unique. Essentially, the only thing that makes an NFT an NFT may be the numbers generated within the smart contract that indicate its identity.",
    "objectLikeExpression": "Object-like Expression",
    "objectLikeExpressionDescription1": "Let's begin by describing the NFT created by the Cadence language. The main code is as follows. The resource definition `NFT` has a member variable `id` that returns its own `id` when asked `whatAreYou`. This resource definition allows us to treat NFT as an object. An object instantiating this resource is stored in the owner's account. This is structurally intuitive and domain-driven design.",
    "objectLikeExpressionDescription2": "Looking at the code further, the NFT resource has the following `getViews` and `resolveView` functions. These are defined in Flow's NFT standard, and can be used to return any of several arbitrary types of metadata for that NFT. Here, I have implemented returning my own defined types, the TextPlain, TextHtml, and ImageSvg structures. These are data representing the NFT's ID with various content types.",
    "objectLikeExpressionDescription3": "The data each looks like the following (for ID = 1):",
    "objectLikeExpressionDescription4": "These are all representations of the same “ID“ in different formats. There can be more types, but the essence of these is that they are some aspect of a single property called “ID“.",
    "conceptualExpression": "Conceptual Expression",
    "conceptualExpressionDescription1": "Next, let's talk about NFTs created by the Solidity language, which follow Ethereum's NFT metadata standard and return metadata for the NFT whose ID is specified by the `tokenURI` function. This implementation returns the NFT's ID as a name and the image URL as a string containing the pre-specified URL followed by the NFT's ID. This structure is actually very distorted. To get metadata by executing the `tokenURI` function, the NFT's ID information is required. But if the essence of metadata is an ID, then we are supposed to specify the ID information we already know and retrieve the information for that same ID. The NFT entity is not on the smart contract.",
    "conceptualExpressionDescription2": "Solidity's NFT contract also provides functions to retrieve NFT metadata for three content types: text/plain, text/html, and image/svg. When executing these functions, the ID of the NFT is also specified, and the functions use the ID information passed as an argument to return data in each format. There is no connection between these data and NFTs anywhere. Now, what is an NFT?",
    "links": "Links",
    "flowscanDescription": "Smart contract with Cadence language",
    "etherscanDescription": "Smart contract with Solidity language",
    "githubDescription": "Source codes and development environment"
  },
  "digitalNativeArt": {
    "workInfo": "Cadence smart contract, 2023",
    "abstract": "Code is executable literature. Blockchain creates a completely new digital world where code exists and continues to run. We can create digital-native entities that exist only in this environment. The “Digital Native Art Series” is a group of smart contract works created in a resource-oriented manner to create such an entity.",
    "digitalNativeArt": "Digital Native Art",
    "digitalNativeArtDescription": "Anyone can interact with this code to create or destroy objects named `Art` in the digital world.",
    "shipOfTheseus": "Ship of Theseus",
    "shipOfTheseusDescription": "Can we say that objects with the same properties but different UUIDs are the same thing? Of the flowing river the flood ever changeth, on the still pool the foam gathering, vanishing, stayeth not. Such too is the lot of men and of the dwellings of men in this world of ours.",
    "planarias": "Planarias",
    "planariasDescription": "I have released 100 planarias into the digital world. They have genes and reproduce sexually and asexually to increase their offspring. How far will they be able to survive and increase their diversity without going extinct?"
  },
  "implicitAgreement": {
    "workInfo": "Ethereum DApp, 2023",
    "abstract": "「Implicit agreement」は、ブロックチェーンや NFT を利用する際に暗黙的に起こっている合意をテーマにした、NFT スマートコントラクトとウェブサイトからなる作品です。ウェブサイトでは誰でも NFT を受け取ることができますが、そのときにあなたはスマートコントラクトの仕様やそこで示されることの解釈について合意をしなければなりません。しかしそれは暗黙的なものであり、内容をすべて理解することは難しいです。"
  }
}